In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import mysql.connector
import sqlalchemy

In [2]:
mydb= mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'codingzone9',
    database = 'sakila'
)

In [3]:
mycursor = mydb.cursor()
mycursor.execute('''
show full tables;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

# 1. Tampilkan daftar 10 film komedi dengan durasi tersingkat. Urutkan data berdasarkan film dengan urasi terpendek. Kolom yang diwajibkan tampil adalah title, category dan length.

In [4]:
mycursor = mydb.cursor()
mycursor.execute('''
select film.title, category.name as category, film.length from film, category, film_category
where film_category.category_id = category.category_id and film_category.film_id = film.film_id and category.name = 'COMEDY'
order by film.length limit 10;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables
# ambil title dari film, nama category dari category, length film dari film, 
# lalu di join dengan primary key dari tabel film, category, dan tabel film_category agar bisa mencapai tujuan yang dimaksud.

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

# 2. Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak. Kolom yang diwajibkan ada minimal adalah kategori, jumlah film dan rata-rata harga sewa.

In [6]:
mycursor = mydb.cursor()
mycursor.execute('''
select distinct(category.name), count(distinct(category.name)) as JumlahMovie, avg(payment.amount) as RataHargaSewa from category, payment, film_category
group by category.name where film_category.category_id = category.category_id
order by count(distinct(category.name));
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'where film_category.category_id = category.category_id
order by count(distinct(c' at line 2

# 3. Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan minimal: id aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan dari aktor/aktris yang membintangi film terbanyak.

In [6]:
mycursor = mydb.cursor()
mycursor.execute('''
select actor.actor_id, actor.first_name, actor.last_name from actor, film, film_actor;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

KeyboardInterrupt: